Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceLoopsOfSplittingCurves Property
 Curve elements forming a closed loop currently cannot be used as splitters and are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceLoopsOfSplittingCurves { get; }
Public Shared ReadOnly Property DividedSurfaceLoopsOfSplittingCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceLoopsOfSplittingCurves {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceLoopsOfSplittingCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace